
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/haruguchi-yuma/aws-ecs-terraform/actions/runs/14418190192)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/7dac8bf9-b204-4b5a-be84-75f26f67399f/terraform-bin apply -auto-approve -input=false
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02a7999140cb7d46b]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a98b100a9e90a27]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083b13fd8062f5801]
aws_security_group.alb: Refreshing state... [id=sg-064f56ad0151fd4c4]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:targetgroup/go-simple-server-target-group/3d6ca46497e5196e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a371ec09c5c42c7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c79b8ce30703dd14]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-056447c0f16234a92]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c4c6f0fdf563338]
aws_security_group.ecs: Refreshing state... [id=sg-0cf92546af3fca408]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0683321158553d692]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-054620f453b63a8dd]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de12d0e72aff9d6a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ebdf5ff77b8d2269]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd033fa9e54ffeb8]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e7655c2afa897b05]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02ee760d8bf1079fa]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-4274032936]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07699eac2ec2333ab]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:loadbalancer/app/go-simple-server-alb/68fbded159ad586e]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-054620f453b63a8dd1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07102b0ebd9f490c1]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036840bbfc61d3a71]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084cb5bd4ae4d314c]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04324b55eef143096]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a29804183b7a0528]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cd033fa9e54ffeb81080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ebdf5ff77b8d22691080289494]
aws_lb_listener.aws_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener-rule/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4/561bb86566bf54b8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:targetgroup/go-simple-server-target-group/3d6ca46497e5196e"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0cf92546af3fca408",
            ]
          + subnets          = [
              + "subnet-056447c0f16234a92",
              + "subnet-0de12d0e72aff9d6a",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs_task: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs: Creating...
aws_iam_role.ecs_task: Creation complete after 1s [id=go-simple-server-ecs-task]
aws_iam_role.ecs: Creation complete after 1s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20250412091029039400000001]
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:710195278619:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:710195278619:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ecs_assume: Reading...%0Adata.aws_iam_policy_document.ecs_task_assume: Reading...%0Aaws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]%0Adata.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02a7999140cb7d46b]%0Adata.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]%0Aaws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a98b100a9e90a27]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083b13fd8062f5801]%0Aaws_security_group.alb: Refreshing state... [id=sg-064f56ad0151fd4c4]%0Aaws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:targetgroup/go-simple-server-target-group/3d6ca46497e5196e]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a371ec09c5c42c7]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c79b8ce30703dd14]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-056447c0f16234a92]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c4c6f0fdf563338]%0Aaws_security_group.ecs: Refreshing state... [id=sg-0cf92546af3fca408]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0683321158553d692]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-054620f453b63a8dd]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de12d0e72aff9d6a]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ebdf5ff77b8d2269]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd033fa9e54ffeb8]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e7655c2afa897b05]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02ee760d8bf1079fa]%0Aaws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-4274032936]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07699eac2ec2333ab]%0Aaws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:loadbalancer/app/go-simple-server-alb/68fbded159ad586e]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-054620f453b63a8dd1080289494]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07102b0ebd9f490c1]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036840bbfc61d3a71]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084cb5bd4ae4d314c]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04324b55eef143096]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a29804183b7a0528]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cd033fa9e54ffeb81080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ebdf5ff77b8d22691080289494]%0Aaws_lb_listener.aws_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4]%0Aaws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener-rule/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4/561bb86566bf54b8]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_cloudwatch_log_group.cloudwatch_log_group will be created%0A  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/ecs/go-simple-server"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 1%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # aws_ecs_cluster.ecs_cluster will be created%0A  + resource "aws_ecs_cluster" "ecs_cluster" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + name     = "go-simple-server"%0A      + tags_all = (known after apply)%0A    }%0A%0A  # aws_ecs_service.ecs_service will be created%0A  + resource "aws_ecs_service" "ecs_service" {%0A      + availability_zone_rebalancing      = "DISABLED"%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 2%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "go-simple-server"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "go-simple-server"%0A          + container_port   = 8080%0A          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:targetgroup/go-simple-server-target-group/3d6ca46497e5196e"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-0cf92546af3fca408",%0A            ]%0A          + subnets          = [%0A              + "subnet-056447c0f16234a92",%0A              + "subnet-0de12d0e72aff9d6a",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.ecs_task_definition will be created%0A  + resource "aws_ecs_task_definition" "ecs_task_definition" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + environment      = [%0A                      + {%0A                          + name  = "HEALTH_CHECK_PATH"%0A                          + value = "/health_checks"%0A                        },%0A                      + {%0A                          + name  = "NGINX_PORT"%0A                          + value = "8080"%0A                        },%0A                    ]%0A                  + image            = "medpeer/health_check:latest"%0A                  + logConfiguration = {%0A                      + logDriver = "awslogs"%0A                      + options   = {%0A                          + awslogs-group         = "/aws/ecs/go-simple-server"%0A                          + awslogs-region        = "ap-northeast-1"%0A                          + awslogs-stream-prefix = "go-simple-server"%0A                        }%0A                    }%0A                  + name             = "go-simple-server"%0A                  + portMappings     = [%0A                      + {%0A                          + containerPort = 8080%0A                          + hostPort      = 8080%0A                        },%0A                    ]%0A                },%0A            ]%0A        )%0A      + cpu                      = "256"%0A      + enable_fault_injection   = (known after apply)%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "go-simple-server"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = (known after apply)%0A      + task_role_arn            = (known after apply)%0A      + track_latest             = false%0A    }%0A%0A  # aws_iam_role.ecs will be created%0A  + resource "aws_iam_role" "ecs" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "go-simple-server-ecs"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_task will be created%0A  + resource "aws_iam_role" "ecs_task" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "go-simple-server-ecs-task"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_basic will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_basic" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = "go-simple-server-ecs"%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0Aaws_cloudwatch_log_group.cloudwatch_log_group: Creating...%0Aaws_iam_role.ecs_task: Creating...%0Aaws_ecs_cluster.ecs_cluster: Creating...%0Aaws_iam_role.ecs: Creating...%0Aaws_iam_role.ecs_task: Creation complete after 1s [id=go-simple-server-ecs-task]%0Aaws_iam_role.ecs: Creation complete after 1s [id=go-simple-server-ecs]%0Aaws_iam_role_policy_attachment.ecs_basic: Creating...%0Aaws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]%0Aaws_ecs_task_definition.ecs_task_definition: Creating...%0Aaws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20250412091029039400000001]%0Aaws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]%0Aaws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]%0Aaws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:710195278619:cluster/go-simple-server]%0Aaws_ecs_service.ecs_service: Creating...%0Aaws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:710195278619:service/go-simple-server/go-simple-server]%0AReleasing state lock. This may take a few moments...%0A%0AApply complete! Resources: 7 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"d03db5cc8763115f15aabba299df4f95a9009cca","Vars":{},"WorkflowName":"Terraform"} -->